app/controllers/api/orders_controller.rb

  def create
    puts "create"
    puts @orders
    order = Order.new(order_params)
    order.save
---
INSERT INTO "orders" ("content", "delivery_date", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "test 4"], ["delivery_date", 2017-05-17 04:00:00 UTC], ["category_id", 1], ["created_at", 2017-05-10 17:38:09 UTC], ["updated_at", 2017-05-10 17:38:09 UTC]]

  def show
    @orders = Order.find(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE (#<Order::ActiveRecord_Relation:0x007f80b25685f8>) LIMIT $1  [["LIMIT", 1]]

  def update
    order = Order.find(params[:id])
    order.update(order_params)
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "orders" SET "content" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["content", "Team work makes the mfn dream work!"], ["updated_at", 2017-05-08 21:37:51 UTC], ["id", 5]]

  def edit
    @orders = Order.find(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]