app/views/devise/registrations/new.html.erb

SELECT  "clients".* FROM "clients" ORDER BY "clients"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
    <%= f.label :client_id %><br />
    <%= f.select :client_id, options_for_select(Client.all.map{|client|[client.id]}) %>