app/views/events/_form.html.erb

    <%= f.label :admin_id %><br />
    <%= f.select :admin_id, options_for_select(User.all.map{|user|[user.id]}), :class => 'input-field' %>
---
SELECT "users".* FROM "users"