app/views/events/show.html.erb

  <tbody>
    <% @event.locations.each do |location| %>
---
SELECT "locations".* FROM "locations" WHERE "locations"."event_id" = $1  [["event_id", 3]]