app/controllers/clients_controller.rb

SELECT "orders".* FROM "orders"
SELECT "locations".* FROM "locations"
---
  def dashboard
    @orders = Order.all
    @locations = Location.all

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."client_id" = $1 AND "events"."id" = $2 LIMIT $3  [["client_id", 1], ["id", 3], ["LIMIT", 1]]
---
    def set_client
      if current_user && current_user.is_event_admin?
      @client = Client.find(current_user.client_id)