app/controllers/events_controller.rb

  def index
    @events = current_user.client.events
    @locations = Location.all
---
SELECT "locations".* FROM "locations"

  def show
    @event = @client.events.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."client_id" = $1 AND "events"."id" = $2 LIMIT $3  [["client_id", 1], ["id", 2], ["LIMIT", 1]]

  def create
    @event = @client.events.new(event_params)

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("title", "start_date", "end_date", "created_at", "updated_at", "client_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "One Music Fest"], ["start_date", Sat, 15 Sep 2018], ["end_date", Sun, 16 Sep 2018], ["created_at", 2018-09-19 00:26:45 UTC], ["updated_at", 2018-09-19 00:26:45 UTC], ["client_id", 1]]

  def update
    @event = @client.events.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(event_params)
---
SELECT  "events".* FROM "events" WHERE "events"."client_id" = $1 AND "events"."id" = $2 LIMIT $3  [["client_id", 1], ["id", 2], ["LIMIT", 1]]
UPDATE "events" SET "start_date" = $1, "end_date" = $2, "latitude" = $3, "longitude" = $4, "updated_at" = $5 WHERE "events"."id" = $6  [["start_date", Sat, 13 May 2017], ["end_date", Sat, 13 May 2017], ["latitude", 33.772993], ["longitude", -84.366288], ["updated_at", 2017-05-09 22:29:22 UTC], ["id", 2]]

  def destroy
   @event = @client.events.find(params[:id])
    @event.destroy
---
SELECT  "events".* FROM "events" WHERE "events"."client_id" = $1 AND "events"."id" = $2 LIMIT $3  [["client_id", 1], ["id", 2], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 5]]

    def set_event
      @event = @client.events.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."client_id" = $1 AND "events"."id" = $2 LIMIT $3  [["client_id", 1], ["id", 2], ["LIMIT", 1]]

    def set_client
      @client = Client.find(current_user.client_id)
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]