app/controllers/items_controller.rb

    def set_client
      if current_user && current_user.is_event_admin?
      @client = Client.find(current_user.client_id)
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]