app/controllers/locations_controller.rb

  def index
    @locations = @event.locations.all
---
SELECT "locations".* FROM "locations" WHERE "locations"."event_id" = $1  [["event_id", 3]]

  def index_as_json
    @locations = @event.locations.all
---
SELECT "locations".* FROM "locations" WHERE "locations"."event_id" = $1  [["event_id", 1]]

  def new
    puts @event
    puts params[:event_id]
    @event = @client.events.find(params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."client_id" = $1 AND "events"."id" = $2 LIMIT $3  [["client_id", 1], ["id", 4], ["LIMIT", 1]]

  def create
    @location = @event.locations.new(location_params)

    respond_to do |format|
      if @location.save
---
INSERT INTO "locations" ("title", "address", "latitude", "longitude", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "blah"], ["address", "austin, texas"], ["latitude", 30.267153], ["longitude", -97.7430608], ["created_at", 2017-05-09 15:13:30 UTC], ["updated_at", 2017-05-09 15:13:30 UTC]]

  def show
    @location = @event.locations.find(params[:id])
---
SELECT  "locations".* FROM "locations" WHERE "locations"."event_id" = $1 AND "locations"."id" = $2 LIMIT $3  [["event_id", 3], ["id", 11], ["LIMIT", 1]]

  def edit
    @location = @event.locations.find(params[:id])
---
SELECT  "locations".* FROM "locations" WHERE "locations"."event_id" = $1 AND "locations"."id" = $2 LIMIT $3  [["event_id", 3], ["id", 14], ["LIMIT", 1]]

  def update
    @location = @event.locations.find(params[:id])

    respond_to do |format|
      if @location.update_attributes(location_params)
---
SELECT  "locations".* FROM "locations" WHERE "locations"."event_id" = $1 AND "locations"."id" = $2 LIMIT $3  [["event_id", 1], ["id", 10], ["LIMIT", 1]]
UPDATE "locations" SET "latitude" = $1, "longitude" = $2, "updated_at" = $3 WHERE "locations"."id" = $4  [["latitude", 33.814073], ["longitude", -84.44759599999999], ["updated_at", 2017-05-09 21:36:12 UTC], ["id", 2]]

  def destroy
    @location = @event.locations.find(params[:id])
    @location.destroy
---
SELECT  "locations".* FROM "locations" WHERE "locations"."event_id" = $1 AND "locations"."id" = $2 LIMIT $3  [["event_id", 3], ["id", 14], ["LIMIT", 1]]
DELETE FROM "locations" WHERE "locations"."id" = $1  [["id", 1]]

  def set_client
    @client = Client.find(current_user.client_id)
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def set_event
      @event = @client.events.find(params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."client_id" = $1 AND "events"."id" = $2 LIMIT $3  [["client_id", 1], ["id", 4], ["LIMIT", 1]]