app/controllers/orders_controller.rb

  def index
    @orders = @event.orders
---
SELECT "orders".* FROM "orders"

  def orders_by_location
    @location = Location.find(params[:location_id])
    @orders = @location.orders
---
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" INNER JOIN "categories" ON "orders"."category_id" = "categories"."id" WHERE "categories"."location_id" = $1  [["location_id", 1]]

  def create
    puts "create"
    puts @orders
    @order = @location.orders.new(order_params)
    binding.pry
      respond_to do |format|
        if @order.save
---
INSERT INTO "orders" ("content", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "Testing"], ["category_id", 1], ["created_at", 2017-05-11 16:57:14 UTC], ["updated_at", 2017-05-11 16:57:14 UTC]]

  def show
    @order = @location.orders.find(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]

  def update
    order = @location.orders.find(params[:id])
    order.update(order_params)
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "orders" SET "content" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["content", "update test"], ["updated_at", 2017-05-11 18:30:54 UTC], ["id", 1]]

  def edit
    @order = @location.orders.find(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def set_location
    @location = Location.find(params[:location_id])
---
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def set_client
    @client = Client.find(current_user.client_id)
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]